src/github_practice.org
#+STARTUP: overview indent align logdone hidestars hideblocks
#+TITLE: Git/GitHub演習
#+AUTHOR: 中鉢 欣秀
#+OPTIONS: ^:{}
#+EXPORT_FILE_NAME: ../docs/index.html
# #+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-bigblow.setup

#+begin_comment
+ HTML形式でこの文書全体をエキスポートする方法
  * スタイルはSETUPFILEで設定
  * エキスポートするファイル名はEXPORT_FILE_NAMEで設定
  * C-c C-e h hでエキスポートし、GitHubにコミット
  * https://blog.chubachi.net/github_practice/
#+end_comment

#+begin_comment
# #+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>
# #+HTML_HEAD: <style>font-family: "Helvetica Neue", "Helvetica", "Hiragino Sans", "Hiragino Kaku Gothic ProN", "Arial", "Yu Gothic", "Meiryo", sans-serif;</style>
#+HTML_HEAD: <style>body { line-height: 150% }</style>
#+end_comment

* Git/GitHub演習の概要
** Git/GitHub演習について
*** 演習の概要
**** この演習について
- この授業ではGitの初心者が，基礎的なGitコマンドの利用方法から，
  GitHub Flowに基づく協同開発の方法までを学ぶ

**** 事前準備
- 事前に gitコマンドが利用できる環境を用意しておくこと
- CUI端末でのshellによる基本的な操作を知っていると
  スムーズに演習ができる

**** 授業の構成
- 個人演習では，テキストの指示に従い，
  Git/GitHubを利用するにあたり必要となる知識を学ぶ
- チーム演習では，GitHubを活用した協同開発の方法を深く学ぼう

**** 授業の進め方
1. 演習の解説
  - 講師が授業の進め方を説明する
2. Git/GitHubを学ぶ個人演習
  - 個人演習を通してGit/GitHubの使い方を学ぶ
3. チーム演習
  - チームでの開発演習を実施する

*** COMMENT 個人演習からチーム演習へ
**** 個人演習からチーム演習への流れ
- この授業では最初に個人演習を行い，その後，チームによる演習に進む
- その際，チーム編成が既に済んでいるか，または，
  そうでないかで演習の進め方が異なる

**** チーム編成が済んでいる場合
- 個人演習としてテキストの課題に取り組む
- テキストを終えたメンバーは他のメンバーを積極的に助ける
- 全員がテキストを終えることを目指す
- 全員が完了，もしくは，時間になったらチーム演習に進む

**** チームがまだできていない場合
- 後ほど席の移動をするので荷物をまとめておく
- 個人演習としてテキストの課題に取り組む
- テキストを完了したら講師・TAに伝えること
- その後，チーム編成を経てチーム演習に進む

**** チームがまだできていない場合の編成方法
- 個人演習が完了した者から順番に2名づつのペアを組んでいく
- できたペアは空いている席に移動して，チーム演習を開始する
- 受講者の半数がペアになったら，それ以降にテキストを終えた者は
  既存のペアに追加していく
- 最終的に3〜4人のグループにする

*** COMMENT 成績評価の方法
**** チーム演習の評価
- チーム演習でのGitHubのリポジトリを対象に，主に以下の項目について評価する
  - コミットの数
  - コミットの粒度（意味のある単位でできるだけ細かく）
  - コミットメッセージの分かりやすさ
  - ブランチの名前が作業内容を表しているか
  - プルリクエストの活用
  - コンフリクトの解消ができたか
  - WikiやIssueの活用
  - README/LICENCE
- _ようするに「GitHub Flow」がうまく回せたか？_

**** 提出物(1)
  - 名前
  - 学籍番号
  - GitHubのアカウント名
  - GitHubのリポジトリのWeb URL
    - 個人演習「our_enpit」
    - チーム演習「team_enpit」

**** 提出物(2)
  - 各自が行った作業の内容
  - 自分が作成したコミット数
  - 自己評価
    - 5段階：5はとても優れている，4は優れている，3は普通，2は劣っている
  - 自己評価の理由
  - 演習全体の感想

**** 成果物の提出方法と補足資料
- 成果物の提出方法や，その他の補足資料はWikiを参照
  - [[https://github.com/ychubachi/github_practice/wiki][Home · ychubachi/github_practice Wiki]]

* 個人演習編
** ローカルリポジトリでGitを使う
*** Gitの操作方法と初期設定
**** Gitチートシート（カンニング表）
- 主なGitコマンドの一覧表
  - [[https://training.github.com/downloads/ja/github-git-cheat-sheet/][GitHub Git チートシート - GitHub Cheatsheets]]
- 必要に応じて印刷しておくとよい

**** Gitコマンドの実行確認
- 端末を操作してGitコマンドを起動してみよう．
- 次のとおり操作することでGitのバージョン番号が確認できる．

#+BEGIN_SRC bash
git --version
#+END_SRC

**** 名前とメールアドレスの登録
- （まだなら）gitに名前とメールアドレスを登録しておく
- 次のコマンドの$NAMEと$EMAILを各自の名前とメールアドレスに置き換えて実行せよ
  - 名前はローマ字で設定すること

#+BEGIN_SRC bash
git config --global user.name $NAME
git config --global user.email $EMAIL
#+END_SRC

**** COMMENT その他の設定
- 次のとおり，設定を行っておく

#+BEGIN_SRC bash
git config --global color.ui auto
git config --global push.default simple
git config --global core.editor emacs
#+END_SRC
  - 1行目: 色付きで表示を見やすく
  - 2行目: pushする方法（詳細省略）
  - 3行目: vimを使う場合はemacsではなくvimを

**** 設定の確認方法
- ここまでの設定を確認する

#+BEGIN_SRC bash
git config -l
#+END_SRC

*** Gitのリポジトリ
**** プロジェクト用のディレクトリ
- リポジトリとはプロジェクトでソースコードなどを
  配置するディレクトリ
  - このディレクトリを「ワーキングディレクトリ
    （ないしはワーキングツリー）」とも言う
- Gitによりバージョン管理ができる
  - ファイルに対する編集作業の内容が追跡され，記録される
- 将来的にGitHubと連携させることで共同作業ができるようになる

**** Gitリポジトリを利用するには
- リポジトリを利用する方法には主に2種類ある
  1. git initコマンドで初期化する方法
  2. git cloneコマンドでGitHubから入手する方法
- ここでは，まず1.について解説する

**** Gitリポジトリの初期化方法
- Gitリポジトリ（my_project）を作成する
  - 1〜2行目: ディレクトリを作成して移動
  - 3行目: Gitリポジトリとして初期化

#+begin_src bash
mkdir ~/my_project
cd ~/my_project
git init
#+end_src

- 以降の作業は作成したmy_projectディレクトリで行うこと
  - 現在のディレクトリは「pwd」コマンドで確認できる

**** リポジトリの状態を確認する方法
- 現在のリポジトリの状態を確認するコマンドは次のとおり

#+begin_src bash
git status
#+end_src

- このコマンドは頻繁に使用する
- 何かうまく行かないことがあったら，このコマンドで状態を確認する癖を
  つけるとよい
  - 表示される内容の意味は徐々に覚えていけば良い

**** COMMENT 「.git」ディレクトリを壊すべからず
- ティレクトリにリポジトリを作成すると「.git」という隠しディレクトリが
  できる
  - ls -aで確認できるが…
- このディレクトリは *絶対に* 手動で変更してはならない
  - もし削除したらGitとは無関係の単なるディレクトリになる

*** コミットの作成方法
**** コミットについて(1)
- Gitの用語における「コミット」とは，「ひとかたまりの作業」をいう
  - 新しい機能を追加した，バグを直した，ドキュメントの内容を更新した，など
- Gitは作業の履歴を，コミットを単位として管理する
  - コミットは次々にリポジトリに追加されていく
  - これにより古いバージョンに戻る，
    過去の変更内容を確認する，などの操作ができる
**** コミットについて(2)
     - コミットには，作業の内容を説明するメッセージをつける
     - コミットには自動的にIDが振られることも覚えておくと良い

**** READMEファイルの作成
- my_projectリポジトリにREADMEファイルを作成してみよう

#+BEGIN_SRC bash
echo "My README file." > README
#+END_SRC

- プロジェクトには *必ずREADMEファイルを用意* しておくこと

**** リポジトリの状態の確認
- git statusで現在のリポジトリの状態を確認する

#+BEGIN_SRC bash
git status
#+END_SRC

- 未追跡のファイル（Untracked files:）の欄に作成したREADMEファイルが
  （赤色で）表示される

**** 変更内容のステージング
- コミットの一つ手前にステージングという段階がある
  - コミットしたい変更はステージングしておく
  - 逆に言えば，変更をコミットするためには，
    ステージングしておかなくてはならない
- ファイルのトラッキング
  - 新しいファイルをステージングすると，これ以降，
    gitがそのファイルの変更を追跡するようになる

**** ステージングの実行
- 作成したREADMEファイルをステージングするには，次のコマンドを打つ

#+BEGIN_SRC bash
git add .
#+END_SRC

- 「git add」の「.（ピリオド）」を忘れないように
  - ピリオドは，リポジトリにおけるすべての変更を意味する
  - 複数のファイルを変更した場合には，ファイル名を指定して
    部分的にステージングすることもできる…
    - が，このやりかたは好ましくない
    - 一度に複数の変更を行うのではなく，一つの変更を終えたら
      こまめにコミットする

