docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-10 Fri 20:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git/GitHub演習</title>
<meta name="author" content="中鉢 欣秀" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Git/GitHub演習</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfc879e2">1. Git/GitHub演習の概要</a>
<ul>
<li><a href="#org1909ae8">1.1. Git/GitHub演習について</a>
<ul>
<li><a href="#org22e65e7">1.1.1. 演習の概要</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3e61689">2. 個人演習編</a>
<ul>
<li><a href="#org739c512">2.1. ローカルリポジトリでGitを使う</a>
<ul>
<li><a href="#orgfc3fdb5">2.1.1. Gitの操作方法と初期設定</a></li>
<li><a href="#orgb861649">2.1.2. Gitのリポジトリ</a></li>
<li><a href="#org22eeb12">2.1.3. コミットの作成方法</a></li>
<li><a href="#org9612dfa">2.1.4. 変更履歴の作成</a></li>
<li><a href="#org571023f">2.1.5. 履歴の確認</a></li>
<li><a href="#org6f2eb39">2.1.6. ブランチの使い方</a></li>
<li><a href="#orga6f75ff">2.1.7. コンフリクト</a></li>
</ul>
</li>
<li><a href="#org812da95">2.2. リモートリポジトリを利用する（GitHub）</a>
<ul>
<li><a href="#orgf4e550d">2.2.1. GitHubとは</a></li>
<li><a href="#orga62661b">2.2.2. リモートリポジトリ</a></li>
<li><a href="#org02f0cf6">2.2.3. GitHub flow</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4c6e0e2">3. チーム演習編</a>
<ul>
<li><a href="#org522b1d8">3.1. 準備と演習</a>
<ul>
<li><a href="#org958c68f">3.1.1. 演習のための準備</a></li>
<li><a href="#org39cef70">3.1.2. チーム演習</a></li>
<li><a href="#org5c660d9">3.1.3. GitHubでのコンフリクトと解消方法</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgabda240">4. 参考資料</a>
<ul>
<li><a href="#orgc4606de">4.1. より進んだGitの操作</a>
<ul>
<li><a href="#org4bba12c">4.1.1. ファイルの削除と名前の変更</a></li>
<li><a href="#org4b89564">4.1.2. 操作を取り消すコマンド</a></li>
<li><a href="#org3b2a411">4.1.3. 作業の一度中断と再開</a></li>
<li><a href="#org8c62fa5">4.1.4. その他知っておくと良いコマンド</a></li>
</ul>
</li>
<li><a href="#org57be1cb">4.2. GitHubでのコンフリクトと解消方法</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfc879e2" class="outline-2">
<h2 id="orgfc879e2"><span class="section-number-2">1.</span> Git/GitHub演習の概要</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1909ae8" class="outline-3">
<h3 id="org1909ae8"><span class="section-number-3">1.1.</span> Git/GitHub演習について</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org22e65e7" class="outline-4">
<h4 id="org22e65e7"><span class="section-number-4">1.1.1.</span> 演習の概要</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org0db0684"></a>この演習について<br />
<div class="outline-text-5" id="text-1-1-1-1">
<ul class="org-ul">
<li>この授業ではGitの初心者が，基礎的なGitコマンドの利用方法から，
GitHub Flowに基づく協同開発の方法までを学ぶ</li>
</ul>
</div>
</li>

<li><a id="org6ed6faa"></a>事前準備<br />
<div class="outline-text-5" id="text-1-1-1-2">
<ul class="org-ul">
<li>事前に gitコマンドが利用できる環境を用意しておくこと</li>
<li>CUI端末でのshellによる基本的な操作を知っていると
スムーズに演習ができる</li>
</ul>
</div>
</li>

<li><a id="org1db81a9"></a>授業の構成<br />
<div class="outline-text-5" id="text-1-1-1-3">
<ul class="org-ul">
<li>個人演習では，テキストの指示に従い，
Git/GitHubを利用するにあたり必要となる知識を学ぶ</li>
<li>チーム演習では，GitHubを活用した協同開発の方法を深く学ぼう</li>
</ul>
</div>
</li>

<li><a id="org8467d9f"></a>授業の進め方<br />
<div class="outline-text-5" id="text-1-1-1-4">
<ol class="org-ol">
<li>演習の解説
<ul class="org-ul">
<li>講師が授業の進め方を説明する</li>
</ul></li>
<li>Git/GitHubを学ぶ個人演習
<ul class="org-ul">
<li>個人演習を通してGit/GitHubの使い方を学ぶ</li>
</ul></li>
<li>チーム演習
<ul class="org-ul">
<li>チームでの開発演習を実施する</li>
</ul></li>
</ol>
</div>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org3e61689" class="outline-2">
<h2 id="org3e61689"><span class="section-number-2">2.</span> 個人演習編</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org739c512" class="outline-3">
<h3 id="org739c512"><span class="section-number-3">2.1.</span> ローカルリポジトリでGitを使う</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgfc3fdb5" class="outline-4">
<h4 id="orgfc3fdb5"><span class="section-number-4">2.1.1.</span> Gitの操作方法と初期設定</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<ol class="org-ol">
<li><a id="org16634ca"></a>Gitチートシート（カンニング表）<br />
<div class="outline-text-5" id="text-2-1-1-1">
<ul class="org-ul">
<li>主なGitコマンドの一覧表
<ul class="org-ul">
<li><a href="https://training.github.com/downloads/ja/github-git-cheat-sheet/">GitHub Git チートシート - GitHub Cheatsheets</a></li>
</ul></li>
<li>必要に応じて印刷しておくとよい</li>
</ul>
</div>
</li>

<li><a id="orgbf708ea"></a>Gitコマンドの実行確認<br />
<div class="outline-text-5" id="text-2-1-1-2">
<ul class="org-ul">
<li>端末を操作してGitコマンドを起動してみよう．</li>
<li>次のとおり操作することでGitのバージョン番号が確認できる．</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git --version
</pre>
</div>
</div>
</li>

<li><a id="org2ff97ea"></a>名前とメールアドレスの登録<br />
<div class="outline-text-5" id="text-2-1-1-3">
<ul class="org-ul">
<li>（まだなら）gitに名前とメールアドレスを登録しておく</li>
<li>次のコマンドの$NAMEと$EMAILを各自の名前とメールアドレスに置き換えて実行せよ
<ul class="org-ul">
<li>名前はローマ字で設定すること</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git config --global user.name $<span style="color: #00538b;">NAME</span>
git config --global user.email $<span style="color: #00538b;">EMAIL</span>
</pre>
</div>
</div>
</li>

<li><a id="org15b5789"></a>設定の確認方法<br />
<div class="outline-text-5" id="text-2-1-1-4">
<ul class="org-ul">
<li>ここまでの設定を確認する</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git config -l
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgb861649" class="outline-4">
<h4 id="orgb861649"><span class="section-number-4">2.1.2.</span> Gitのリポジトリ</h4>
<div class="outline-text-4" id="text-2-1-2">
</div>
<ol class="org-ol">
<li><a id="org7ee166a"></a>プロジェクト用のディレクトリ<br />
<div class="outline-text-5" id="text-2-1-2-1">
<ul class="org-ul">
<li>リポジトリとはプロジェクトでソースコードなどを
配置するディレクトリ
<ul class="org-ul">
<li>このディレクトリを「ワーキングディレクトリ
（ないしはワーキングツリー）」とも言う</li>
</ul></li>
<li>Gitによりバージョン管理ができる
<ul class="org-ul">
<li>ファイルに対する編集作業の内容が追跡され，記録される</li>
</ul></li>
<li>将来的にGitHubと連携させることで共同作業ができるようになる</li>
</ul>
</div>
</li>

<li><a id="orgdbf9050"></a>Gitリポジトリを利用するには<br />
<div class="outline-text-5" id="text-2-1-2-2">
<ul class="org-ul">
<li>リポジトリを利用する方法には主に2種類ある
<ol class="org-ol">
<li>git initコマンドで初期化する方法</li>
<li>git cloneコマンドでGitHubから入手する方法</li>
</ol></li>
<li>ここでは，まず1.について解説する</li>
</ul>
</div>
</li>

<li><a id="org96f98b8"></a>Gitリポジトリの初期化方法<br />
<div class="outline-text-5" id="text-2-1-2-3">
<ul class="org-ul">
<li>Gitリポジトリ（my_project）を作成する
<ul class="org-ul">
<li>1〜2行目: ディレクトリを作成して移動</li>
<li>3行目: Gitリポジトリとして初期化</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">mkdir ~/my_project
<span style="color: #8f0075;">cd</span> ~/my_project
git init
</pre>
</div>

<ul class="org-ul">
<li>以降の作業は作成したmy_projectディレクトリで行うこと
<ul class="org-ul">
<li>現在のディレクトリは「pwd」コマンドで確認できる</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org330d172"></a>リポジトリの状態を確認する方法<br />
<div class="outline-text-5" id="text-2-1-2-4">
<ul class="org-ul">
<li>現在のリポジトリの状態を確認するコマンドは次のとおり</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git status
</pre>
</div>

<ul class="org-ul">
<li>このコマンドは頻繁に使用する</li>
<li>何かうまく行かないことがあったら，このコマンドで状態を確認する癖を
つけるとよい
<ul class="org-ul">
<li>表示される内容の意味は徐々に覚えていけば良い</li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org22eeb12" class="outline-4">
<h4 id="org22eeb12"><span class="section-number-4">2.1.3.</span> コミットの作成方法</h4>
<div class="outline-text-4" id="text-2-1-3">
</div>
<ol class="org-ol">
<li><a id="orgc509524"></a>コミットについて(1)<br />
<div class="outline-text-5" id="text-2-1-3-1">
<ul class="org-ul">
<li>Gitの用語における「コミット」とは，「ひとかたまりの作業」をいう
<ul class="org-ul">
<li>新しい機能を追加した，バグを直した，ドキュメントの内容を更新した，など</li>
</ul></li>
<li>Gitは作業の履歴を，コミットを単位として管理する
<ul class="org-ul">
<li>コミットは次々にリポジトリに追加されていく</li>
<li>これにより古いバージョンに戻る，
過去の変更内容を確認する，などの操作ができる</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org3332c18"></a>コミットについて(2)<br />
<div class="outline-text-5" id="text-2-1-3-2">
<ul class="org-ul">
<li>コミットには，作業の内容を説明するメッセージをつける</li>
<li>コミットには自動的にIDが振られることも覚えておくと良い</li>
</ul>
</div>
</li>

<li><a id="orge5da327"></a>READMEファイルの作成<br />
<div class="outline-text-5" id="text-2-1-3-3">
<ul class="org-ul">
<li>my_projectリポジトリにREADMEファイルを作成してみよう</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8f0075;">echo</span> <span style="color: #2544bb;">"My README file."</span> &gt; README
</pre>
</div>

<ul class="org-ul">
<li>プロジェクトには <b>必ずREADMEファイルを用意</b> しておくこと</li>
</ul>
</div>
</li>

<li><a id="orgc1bbde4"></a>リポジトリの状態の確認<br />
<div class="outline-text-5" id="text-2-1-3-4">
<ul class="org-ul">
<li>git statusで現在のリポジトリの状態を確認する</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git status
</pre>
</div>

<ul class="org-ul">
<li>未追跡のファイル（Untracked files:）の欄に作成したREADMEファイルが
（赤色で）表示される</li>
</ul>
</div>
</li>

<li><a id="org5faf027"></a>変更内容のステージング<br />
<div class="outline-text-5" id="text-2-1-3-5">
<ul class="org-ul">
<li>コミットの一つ手前にステージングという段階がある
<ul class="org-ul">
<li>コミットしたい変更はステージングしておく</li>
<li>逆に言えば，変更をコミットするためには，
ステージングしておかなくてはならない</li>
</ul></li>
<li>ファイルのトラッキング
<ul class="org-ul">
<li>新しいファイルをステージングすると，これ以降，
gitがそのファイルの変更を追跡するようになる</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org9bb375d"></a>ステージングの実行<br />
<div class="outline-text-5" id="text-2-1-3-6">
<ul class="org-ul">
<li>作成したREADMEファイルをステージングするには，次のコマンドを打つ</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git add .
</pre>
</div>

<ul class="org-ul">
<li>「git add」の「.（ピリオド）」を忘れないように
<ul class="org-ul">
<li>ピリオドは，リポジトリにおけるすべての変更を意味する</li>
<li>複数のファイルを変更した場合には，ファイル名を指定して
部分的にステージングすることもできる…
<ul class="org-ul">
<li>が，このやりかたは好ましくない</li>
<li>一度に複数の変更を行うのではなく，一つの変更を終えたら
こまめにコミットする</li>
</ul></li>
</ul></li>
</ul>
</div>
</li>
