src/github_practice.org
**** ステージング後のリポジトリへの状態
- 再度，git statusコマンドで状態を確認しよう

#+BEGIN_SRC bash
git status
#+END_SRC

- コミットされる変更（Changes to be committed:）の欄に，READMEファイルが
  （緑色で）表示されれば正しい結果である

**** ステージングされた内容をコミットする
- ステージング段階にある変更内容をコミットする
- コミットにはその内容を示すメッセージ文をつける
- 「First commit」というメッセージをつけて新しいコミットを作成する
  - 「-m」オプションはそれに続く文字列をメッセージとして付与することを
    指示するもの

#+BEGIN_SRC bash
git commit -m 'First commit'
#+END_SRC

**** コミット後の状態の確認
- コミットが正常に行われたことを確認する
  - ここでもgit statusコマンドか活躍する

#+BEGIN_SRC bash
git status
#+END_SRC

- 「nothing to commit, ...」との表示から
  コミットすべきものがない（＝過去の変更はコミットされた）ことが
  わかる
- この表示がでたら（無事コミットできたので）一安心してよい

*** 変更履歴の作成
**** 更なるコミットを作成する
- リポジトリで変更作業を行い，新しいコミットを追加する
  - READMEファイルに新しい行を追加する
- 次の$NAMEをあなたの名前に変更して実行しなさい

#+BEGIN_SRC bash
echo $NAME >> README
#+END_SRC

- 既存のファイルへの追加なので「>>」を用いていることに注意

**** 変更後の状態の確認
- リポジトリの状態をここでも確認する

#+BEGIN_SRC bash
git status
#+END_SRC

- コミットのためにステージされていない変更（Changes not staged for commit:）の
  欄に，変更された（modified）ファイルとしてREADMEが表示される

**** 差分の確認
- トラックされているファイルの変更箇所を確認する

#+BEGIN_SRC bash
git diff
#+END_SRC

- 頭に「+」のある（緑色で表示された）行が新たに追加された内容を示す
  - 削除した場合は「-」がつく

**** 新たな差分をステージングする
- 作成した差分をコミットできるようにするために，ステージング段階に上げる

#+BEGIN_SRC bash
git add .
#+END_SRC

- =git status= を行い，READMEファイルが「Changed to be commited:」の欄に
  （緑色で）表示されていることを確認する

**** ステージングされた新しい差分のコミット
- 変更内容を示すメッセージとともにコミットする

#+BEGIN_SRC bash
git commit -m 'Add my name'
#+END_SRC

*** 履歴の確認
**** バージョン履歴の確認
- これまでの変更作業の履歴を確認
  - 2つのコミットが存在する

#+BEGIN_SRC bash
git log
#+END_SRC

- 各コミットごとに表示される内容
  - コミットのID（commit に続く英文字と数字の列）
  - AuthorとDate
  - コミットメッセージ

**** コミットの情報確認
- 次のコマンドでコミットで行った変更内容が確認できる

#+BEGIN_SRC bash
git show $COMMIT_ID
#+END_SRC

**** 2つのコミットの比較
- 異なる２つのコミットの変更差分は次のコマンドで確認できる
  - コミットのIDはlogで確認できる
    （コマンドでIDを指定する場合は，概ね先頭4文字を入力し後は省略してよい）

#+BEGIN_SRC bash
git diff $COMMIT_ID_1 $COMMIT_ID_2
#+END_SRC

*** ブランチの使い方
**** ブランチとは
- 「ひとまとまりの作業」を行う場所
- ソースコードなどの編集作業を始める際には
  必ず新しいブランチを作成する
- Gitの内部的にはあるコミットに対するエイリアス（alias）である

**** masterは大事なブランチ
- Gitリポジトリの初期化後，最初のコミットを行うとmasterブランチができる
- 非常に重要なブランチであり，
  ここで _直接編集作業を行ってはならない_
  - ただし，本演習や，個人でGitを利用する場合はこの限りではない

**** ブランチの作成と移動
- 新しいブランチ「new_branch」を作成して，なおかつ，そのブランチに移動する
  - 「-b」オプションで新規作成
  - オプションがなければ単なる移動（後述）

#+BEGIN_SRC bash
git checkout -b new_branch
#+END_SRC

- 本来，ブランチには _「これから行う作業の内容」_ が分かる名前を付ける

**** ブランチの確認
- ブランチの一覧と現在のブランチを確認する
  - もともとあるmasterと，新しく作成したnew_branchが表示される

#+BEGIN_SRC bash
git branch -vv
#+END_SRC

- ブランチに紐づくコミットのIDが同じことも確認
- git statusの一行目にも現在のブランチが表示される

**** ブランチでのコミット作成
- READMEに現在の日時を追加

#+BEGIN_SRC bash
date >> README
git add .
git commit -m 'Add date'
#+END_SRC

- 新しいコミットが追加できたことをgit logで確認
- git branch -vvでコミットのIDが変化したことも確認

**** ブランチの移動
- new_branchブランチでコミットした内容をmasterに反映させる
  - まずはmasterに移動する

#+BEGIN_SRC bash
git checkout master
#+END_SRC

- git status，git branch -vvで現在のブランチを確認すること
- この段階では，READMEファイルに行った変更が _反映されてない_ ことを
  確認すること

**** 変更をmasterにマージ
- new_branchで行ったコミットをmasterに反映させる

#+BEGIN_SRC bash
git merge new_branch
#+END_SRC

- READMEに更新が反映されたことを確認
- git branch -vvにより両ブランチのコミットIDが同じになったことも確認
- git logも確認しておきたい

**** マージ済みブランチの削除

- マージしたブランチはもはや不要なので削除して良い

#+BEGIN_SRC bash
git branch -d new_branch
#+END_SRC

- git branch -vvコマンドで削除を確認

*** コンフリクト
**** コンフリクトとは
- ファイルの同じ箇所を，異なる内容に編集すると発生する
- Gitはどちらの内容が正しいのかわからない
- 次のシナリオに従い，コンフリクトを発生させてみよう

**** コンフリクトのシナリオ
- 「のび太」の作業
  - nobitaブランチを作成する
  - READMEファイルの *一行目* を「Nobita's README.」に変更する
  - 変更をaddしてcommitする
- ここで一度， *masterブランチ* にもどる
  - READMEがもとのままだあることを確認
- 「しずか」の作業
  - shizukaブランチを作成する
  - READMEファイルの *一行目* を「Shizuka's file.」に変更する
  - 変更をaddしてcommitする

**** マージとコンフリクト発生
- masterブランチに移動する
- まず，nobitaブランチをマージ
  - 問題なくマージできる
- 次に，shizukaブランチをマージ
  - ここで *コンフリクトが発生* する

**** コンフリクト時のメッセージ
- mergeに失敗するとようなメッセージが出る

#+BEGIN_SRC text
Auto-merging README
CONFLICT (content): Merge conflict in README
Automatic merge failed; fix conflicts and then commit the result.
#+END_SRC

- また，git statusするとUnmerged pathes:の欄に，「both modified: README」
  と表示される

**** READMEファイルの内容
- READMEを開くとコンフリクトが起きた箇所がわかる

#+BEGIN_SRC text
<<<<<<< HEAD
Nobita's README.
=======
Shizuka's file.
>>>>>>> shizuka
（以下略）
#+END_SRC

- =======の上がマージ前のmasterブランチ，
  下がマージしようとしたshizukaブランチの内容

**** コンフリクトの解消
- テキストエディタで修正し，手動でコンフリクトを解消する

#+BEGIN_SRC text
Nobita & Shizuka's READMEfile.
（以下略）
#+END_SRC

**** 解消した結果をコミットする
- その後はいつもどおり，addしてcommitすれば作業が継続できる
  - マージ済みのmasterから新しくブランチを作成すること
- なお， _テキストエディタを用い，手動で正しくコンフリクトを解消する前でも
  commitできてしまう_ ので，この点には注意する

** リモートリポジトリを利用する（GitHub）
*** GitHubとは
