docs/index.html

<li><a id="org74cd9a7"></a>ステージング後のリポジトリへの状態<br />
<div class="outline-text-5" id="text-2-1-3-7">
<ul class="org-ul">
<li>再度，git statusコマンドで状態を確認しよう</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git status
</pre>
</div>

<ul class="org-ul">
<li>コミットされる変更（Changes to be committed:）の欄に，READMEファイルが
（緑色で）表示されれば正しい結果である</li>
</ul>
</div>
</li>

<li><a id="org03eef47"></a>ステージングされた内容をコミットする<br />
<div class="outline-text-5" id="text-2-1-3-8">
<ul class="org-ul">
<li>ステージング段階にある変更内容をコミットする</li>
<li>コミットにはその内容を示すメッセージ文をつける</li>
<li>「First commit」というメッセージをつけて新しいコミットを作成する
<ul class="org-ul">
<li>「-m」オプションはそれに続く文字列をメッセージとして付与することを
指示するもの</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git commit -m <span style="color: #2544bb;">'First commit'</span>
</pre>
</div>
</div>
</li>

<li><a id="orgb14325f"></a>コミット後の状態の確認<br />
<div class="outline-text-5" id="text-2-1-3-9">
<ul class="org-ul">
<li>コミットが正常に行われたことを確認する
<ul class="org-ul">
<li>ここでもgit statusコマンドか活躍する</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git status
</pre>
</div>

<ul class="org-ul">
<li>「nothing to commit, &#x2026;」との表示から
コミットすべきものがない（＝過去の変更はコミットされた）ことが
わかる</li>
<li>この表示がでたら（無事コミットできたので）一安心してよい</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org9612dfa" class="outline-4">
<h4 id="org9612dfa"><span class="section-number-4">2.1.4.</span> 変更履歴の作成</h4>
<div class="outline-text-4" id="text-2-1-4">
</div>
<ol class="org-ol">
<li><a id="org13b83c9"></a>更なるコミットを作成する<br />
<div class="outline-text-5" id="text-2-1-4-1">
<ul class="org-ul">
<li>リポジトリで変更作業を行い，新しいコミットを追加する
<ul class="org-ul">
<li>READMEファイルに新しい行を追加する</li>
</ul></li>
<li>次の$NAMEをあなたの名前に変更して実行しなさい</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8f0075;">echo</span> $<span style="color: #00538b;">NAME</span> &gt;&gt; README
</pre>
</div>

<ul class="org-ul">
<li>既存のファイルへの追加なので「&gt;&gt;」を用いていることに注意</li>
</ul>
</div>
</li>

<li><a id="orgbd3cf18"></a>変更後の状態の確認<br />
<div class="outline-text-5" id="text-2-1-4-2">
<ul class="org-ul">
<li>リポジトリの状態をここでも確認する</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git status
</pre>
</div>

<ul class="org-ul">
<li>コミットのためにステージされていない変更（Changes not staged for commit:）の
欄に，変更された（modified）ファイルとしてREADMEが表示される</li>
</ul>
</div>
</li>

<li><a id="orgc52aac7"></a>差分の確認<br />
<div class="outline-text-5" id="text-2-1-4-3">
<ul class="org-ul">
<li>トラックされているファイルの変更箇所を確認する</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git diff
</pre>
</div>

<ul class="org-ul">
<li>頭に「+」のある（緑色で表示された）行が新たに追加された内容を示す
<ul class="org-ul">
<li>削除した場合は「-」がつく</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org8d5eb47"></a>新たな差分をステージングする<br />
<div class="outline-text-5" id="text-2-1-4-4">
<ul class="org-ul">
<li>作成した差分をコミットできるようにするために，ステージング段階に上げる</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git add .
</pre>
</div>

<ul class="org-ul">
<li><code>git status</code> を行い，READMEファイルが「Changed to be commited:」の欄に
（緑色で）表示されていることを確認する</li>
</ul>
</div>
</li>

<li><a id="org2665bdb"></a>ステージングされた新しい差分のコミット<br />
<div class="outline-text-5" id="text-2-1-4-5">
<ul class="org-ul">
<li>変更内容を示すメッセージとともにコミットする</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git commit -m <span style="color: #2544bb;">'Add my name'</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org571023f" class="outline-4">
<h4 id="org571023f"><span class="section-number-4">2.1.5.</span> 履歴の確認</h4>
<div class="outline-text-4" id="text-2-1-5">
</div>
<ol class="org-ol">
<li><a id="org96e71b4"></a>バージョン履歴の確認<br />
<div class="outline-text-5" id="text-2-1-5-1">
<ul class="org-ul">
<li>これまでの変更作業の履歴を確認
<ul class="org-ul">
<li>2つのコミットが存在する</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git log
</pre>
</div>

<ul class="org-ul">
<li>各コミットごとに表示される内容
<ul class="org-ul">
<li>コミットのID（commit に続く英文字と数字の列）</li>
<li>AuthorとDate</li>
<li>コミットメッセージ</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org0933e3f"></a>コミットの情報確認<br />
<div class="outline-text-5" id="text-2-1-5-2">
<ul class="org-ul">
<li>次のコマンドでコミットで行った変更内容が確認できる</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git show $<span style="color: #00538b;">COMMIT_ID</span>
</pre>
</div>
</div>
</li>

<li><a id="org8818d79"></a>2つのコミットの比較<br />
<div class="outline-text-5" id="text-2-1-5-3">
<ul class="org-ul">
<li>異なる２つのコミットの変更差分は次のコマンドで確認できる
<ul class="org-ul">
<li>コミットのIDはlogで確認できる
（コマンドでIDを指定する場合は，概ね先頭4文字を入力し後は省略してよい）</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git diff $<span style="color: #00538b;">COMMIT_ID_1</span> $<span style="color: #00538b;">COMMIT_ID_2</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org6f2eb39" class="outline-4">
<h4 id="org6f2eb39"><span class="section-number-4">2.1.6.</span> ブランチの使い方</h4>
<div class="outline-text-4" id="text-2-1-6">
</div>
<ol class="org-ol">
<li><a id="orgccac966"></a>ブランチとは<br />
<div class="outline-text-5" id="text-2-1-6-1">
<ul class="org-ul">
<li>「ひとまとまりの作業」を行う場所</li>
<li>ソースコードなどの編集作業を始める際には
必ず新しいブランチを作成する</li>
<li>Gitの内部的にはあるコミットに対するエイリアス（alias）である</li>
</ul>
</div>
</li>

<li><a id="org93ef3af"></a>masterは大事なブランチ<br />
<div class="outline-text-5" id="text-2-1-6-2">
<ul class="org-ul">
<li>Gitリポジトリの初期化後，最初のコミットを行うとmasterブランチができる</li>
<li>非常に重要なブランチであり，
ここで <span class="underline">直接編集作業を行ってはならない</span>
<ul class="org-ul">
<li>ただし，本演習や，個人でGitを利用する場合はこの限りではない</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="orge1169c8"></a>ブランチの作成と移動<br />
<div class="outline-text-5" id="text-2-1-6-3">
<ul class="org-ul">
<li>新しいブランチ「new_branch」を作成して，なおかつ，そのブランチに移動する
<ul class="org-ul">
<li>「-b」オプションで新規作成</li>
<li>オプションがなければ単なる移動（後述）</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git checkout -b new_branch
</pre>
</div>

<ul class="org-ul">
<li>本来，ブランチには <span class="underline">「これから行う作業の内容」</span> が分かる名前を付ける</li>
</ul>
</div>
</li>

<li><a id="orgbfe92b3"></a>ブランチの確認<br />
<div class="outline-text-5" id="text-2-1-6-4">
<ul class="org-ul">
<li>ブランチの一覧と現在のブランチを確認する
<ul class="org-ul">
<li>もともとあるmasterと，新しく作成したnew_branchが表示される</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git branch -vv
</pre>
</div>

<ul class="org-ul">
<li>ブランチに紐づくコミットのIDが同じことも確認</li>
<li>git statusの一行目にも現在のブランチが表示される</li>
</ul>
</div>
</li>

<li><a id="org78c8be9"></a>ブランチでのコミット作成<br />
<div class="outline-text-5" id="text-2-1-6-5">
<ul class="org-ul">
<li>READMEに現在の日時を追加</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">date &gt;&gt; README
git add .
git commit -m <span style="color: #2544bb;">'Add date'</span>
</pre>
</div>

<ul class="org-ul">
<li>新しいコミットが追加できたことをgit logで確認</li>
<li>git branch -vvでコミットのIDが変化したことも確認</li>
</ul>
</div>
</li>

<li><a id="org68bbf7f"></a>ブランチの移動<br />
<div class="outline-text-5" id="text-2-1-6-6">
<ul class="org-ul">
<li>new_branchブランチでコミットした内容をmasterに反映させる
<ul class="org-ul">
<li>まずはmasterに移動する</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git checkout master
</pre>
</div>

<ul class="org-ul">
<li>git status，git branch -vvで現在のブランチを確認すること</li>
<li>この段階では，READMEファイルに行った変更が <span class="underline">反映されてない</span> ことを
確認すること</li>
</ul>
</div>
</li>

<li><a id="org815c7f5"></a>変更をmasterにマージ<br />
<div class="outline-text-5" id="text-2-1-6-7">
<ul class="org-ul">
<li>new_branchで行ったコミットをmasterに反映させる</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git merge new_branch
</pre>
</div>

<ul class="org-ul">
<li>READMEに更新が反映されたことを確認</li>
<li>git branch -vvにより両ブランチのコミットIDが同じになったことも確認</li>
<li>git logも確認しておきたい</li>
</ul>
</div>
</li>

<li><a id="org67385ba"></a>マージ済みブランチの削除<br />
<div class="outline-text-5" id="text-2-1-6-8">
<ul class="org-ul">
<li>マージしたブランチはもはや不要なので削除して良い</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git branch -d new_branch
</pre>
</div>

<ul class="org-ul">
<li>git branch -vvコマンドで削除を確認</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-orga6f75ff" class="outline-4">
<h4 id="orga6f75ff"><span class="section-number-4">2.1.7.</span> コンフリクト</h4>
<div class="outline-text-4" id="text-2-1-7">
</div>
<ol class="org-ol">
<li><a id="org46d9aea"></a>コンフリクトとは<br />
<div class="outline-text-5" id="text-2-1-7-1">
<ul class="org-ul">
<li>ファイルの同じ箇所を，異なる内容に編集すると発生する</li>
<li>Gitはどちらの内容が正しいのかわからない</li>
<li>次のシナリオに従い，コンフリクトを発生させてみよう</li>
</ul>
</div>
</li>

<li><a id="orgc47d0ae"></a>コンフリクトのシナリオ<br />
<div class="outline-text-5" id="text-2-1-7-2">
<ul class="org-ul">
<li>「のび太」の作業
<ul class="org-ul">
<li>nobitaブランチを作成する</li>
<li>READMEファイルの <b>一行目</b> を「Nobita's README.」に変更する</li>
<li>変更をaddしてcommitする</li>
</ul></li>
<li>ここで一度， <b>masterブランチ</b> にもどる
<ul class="org-ul">
<li>READMEがもとのままだあることを確認</li>
</ul></li>
<li>「しずか」の作業
<ul class="org-ul">
<li>shizukaブランチを作成する</li>
<li>READMEファイルの <b>一行目</b> を「Shizuka's file.」に変更する</li>
<li>変更をaddしてcommitする</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org3b27eb9"></a>マージとコンフリクト発生<br />
<div class="outline-text-5" id="text-2-1-7-3">
<ul class="org-ul">
<li>masterブランチに移動する</li>
<li>まず，nobitaブランチをマージ
<ul class="org-ul">
<li>問題なくマージできる</li>
</ul></li>
<li>次に，shizukaブランチをマージ
<ul class="org-ul">
<li>ここで <b>コンフリクトが発生</b> する</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org41a3ca8"></a>コンフリクト時のメッセージ<br />
<div class="outline-text-5" id="text-2-1-7-4">
<ul class="org-ul">
<li>mergeに失敗するとようなメッセージが出る</li>
</ul>

<div class="org-src-container">
<pre class="src src-text">Auto-merging README
CONFLICT (content): Merge conflict in README
Automatic merge failed; fix conflicts and then commit the result.
</pre>
</div>

<ul class="org-ul">
<li>また，git statusするとUnmerged pathes:の欄に，「both modified: README」
と表示される</li>
</ul>
</div>
</li>

<li><a id="orgfc64a5c"></a>READMEファイルの内容<br />
<div class="outline-text-5" id="text-2-1-7-5">
<ul class="org-ul">
<li>READMEを開くとコンフリクトが起きた箇所がわかる</li>
</ul>

<div class="org-src-container">
<pre class="src src-text">&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
Nobita's README.
=======
Shizuka's file.
&gt;&gt;&gt;&gt;&gt;&gt;&gt; shizuka
&#65288;&#20197;&#19979;&#30053;&#65289;
</pre>
</div>

<ul class="org-ul">
<li>=======の上がマージ前のmasterブランチ，
下がマージしようとしたshizukaブランチの内容</li>
</ul>
</div>
</li>

<li><a id="org2ef8cda"></a>コンフリクトの解消<br />
<div class="outline-text-5" id="text-2-1-7-6">
<ul class="org-ul">
<li>テキストエディタで修正し，手動でコンフリクトを解消する</li>
</ul>

<div class="org-src-container">
<pre class="src src-text">Nobita &amp; Shizuka's READMEfile.
&#65288;&#20197;&#19979;&#30053;&#65289;
</pre>
</div>
</div>
</li>

<li><a id="org429e89a"></a>解消した結果をコミットする<br />
<div class="outline-text-5" id="text-2-1-7-7">
<ul class="org-ul">
<li>その後はいつもどおり，addしてcommitすれば作業が継続できる
<ul class="org-ul">
<li>マージ済みのmasterから新しくブランチを作成すること</li>
</ul></li>
<li>なお， <span class="underline">テキストエディタを用い，手動で正しくコンフリクトを解消する前でも
commitできてしまう</span> ので，この点には注意する</li>
</ul>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org812da95" class="outline-3">
<h3 id="org812da95"><span class="section-number-3">2.2.</span> リモートリポジトリを利用する（GitHub）</h3>
<div class="outline-text-3" id="text-2-2">
</div>
