src/github_practice.org
**** GitHubでソーシャルコーディング
- ソーシャルコーディングのためのクラウド環境
  - [[https://github.com/][GitHub]]
  - [[http://github.co.jp/][GitHub Japan]]
- GitHubが提供する主な機能
  - GitHub flowによる協同開発
  - Pull requests
  - Issue / Wiki

**** GitHubアカウントの作成
- （まだなら）次のURLの指示に従いGitHubアカウントを作成
  - [[https://help.github.com/articles/signing-up-for-a-new-github-account/][Signing up for a new GitHub account - User Documentation]]
- アカウントの種類
  - 無料版で作成する場合「Join GitHub for Free」を選択する
  - 学生の場合「Student Developer Pack」にアップグレードすることもできる
- その後，確認メールが届くので，必要に応じて残りの手順を実施せよ
  - [[https://help.github.com/categories/setup/][GitHub Help]]

**** SSHによるGitHubアクセス
- GitHubへのアクセスはSSHを用いた公開鍵暗号方式の認証を用いる
  - SSH公開鍵の設定を行えば以降のパスワード認証が不要になる
- （まだなら）SSHを生成してGitHubに登録しなさい
  - 鍵を生成するとき「passphrases」が聞かれるが，この演習では何も入力しなくてよい
- 参考
  - [[https://docs.github.com/en/authentication/connecting-to-github-with-ssh/generating-a-new-ssh-key-and-adding-it-to-the-ssh-agent][Generating a new SSH key and adding it to the ssh-agent - GitHub Docs]]
  - [[https://help.github.com/articles/generating-an-ssh-key/][Generating an SSH key - User Documentation]]

*** リモートリポジトリ
**** リモート VS ローカルリポジトリ
- ローカルリポジトリ
  - git initコマンドを用いて作成したリポジトリを「ローカルリポジトリ」という
- リモートリポジトリ
  - 「リモートリポジトリ」とは，サーバ上にあるリポジトリであり，
    ローカルのリポジトリと連携させることができる
- リモートリポジトリの利点
  - ネットワークを経由してどこからでも利用することができる
  - 複数人のチームで協同作業をするときに活用できる
**** リモートリポジトリの作成
- リモートリポジトリをGitHubで作成する
  - 名前は「our_project」とする
- 次の手順で作成する
  - [[https://help.github.com/articles/creating-a-new-repository/][Creating a new repository - User Documentation]]
- READMEとライセンスを追加すること
  - 「Initialize this repository with a README」にチェックを入れる
  - 「Add a license:」から「MIT License」を選ぶ
**** mainブランチについて
- git initでは最初にできるブランチは *master* である
- GitHubでリポジトリを作成した場合は *main* に変更された
  - [[https://github.blog/changelog/2020-10-01-the-default-branch-for-newly-created-repositories-is-now-main/][The default branch for newly-created repositories is now main | GitHub Changelog]]
- 以降、masterブランチとの記述は、必要に応じてmainブランチだと読み替えること
*** GitHub flow
**** GitHub flowwによる開発の流れ
- GitHub flow
  - [[https://guides.github.com/introduction/flow/][Understanding the GitHub Flow · GitHub Guides]]

**** 1: リモートリポジトリをローカルに複製
- リモートにあるリポジトリをローカルに複製することをcloneという
  - [[https://help.github.com/articles/cloning-a-repository/][Cloning a repository - User Documentation]]
- 下記の「$GITHUB_URL」の部分をGitHubのour_projectリポジトリURLにして実行
  - URLは「git@...」で始まるSSH接続用のものを用いる
    - リポジトリのURLはブラウザ用のURLとは異なるので注意！

#+begin_src bash
cd ~
git clone $GITHUB_URL
cd our_project
#+end_src

- この作業は基本的にはプロジェクトに対して一度だけ行うこと

**** 2: mainから作業用ブランチを作成
- 作業用のブランチを作成して移動する
  - ブランチの名前は「greeting」とする

#+BEGIN_SRC bash
git checkout -b greeting
#+END_SRC

**** 3: ブランチで編集作業を行う
- ここでは，hello.txtという名前のファイルを作成する

#+BEGIN_SRC bash
echo 'Hello GitHub' > hello.txt
#+END_SRC

**** 4: ブランチでコミットを作成
- 変更した内容をステージングしてからコミットする

#+BEGIN_SRC bash
git add .
git commit -m 'Create hello.txt'
#+END_SRC

- この編集，add，commitの作業は作業が一区切りつくまで何回も繰り返してよい…
  - が，こまめにpushするのが良いとされる

**** 5: ブランチをリモートに送る
- ブランチで作成したコミットをリモートに送る
  - 下記のoriginはリポジトリのURLの別名として自動で設定されているもの
  - greetingは作業しているブランチ名

#+begin_src bash
git push -u origin greeting
#+end_src

**** 6. GitHubでプルリクエストを送る
- ブランチがGitHubに登録されたことを確認し，Pull requestを作成する
- 手順は次のとおり
  - [[https://help.github.com/articles/using-pull-requests/][Using pull requests - User Documentation]] の前半
  - [[https://help.github.com/articles/creating-a-pull-request/][Creating a pull request - User Documentation]]

**** 7. GitHubでレビュー（＋自動テスト）
- プルリクエストを用いたレビューの方法は下記参照
  - [[https://help.github.com/articles/using-pull-requests/][Using pull requests - User Documentation]] の後半
- 人手によるレビューの他，自動的なテストも行うのが望ましい（説明は省略）

**** 8. GitHubでプルリクエストをマージ
- Pull requestのレビューが済んだらマージする
  - [[https://help.github.com/articles/merging-a-pull-request/][Merging a pull request - User Documentation]]
- マージが完了したら，ローカル・リモート共に，マージ済みのブランチは削除してよい

**** 9. ローカルのmainを最新版にする
- GitHubで行ったマージをローカルに反映させる
  - masterブランチに移動してgit pull
  - 不要になった作業用ブランチは削除

#+begin_src bash
git checkout master
git pull
git branch -d greeting
#+end_src

**** GitHub Flowに習熟する！                                        :演習:
- ここで手順2:（[[2: mainから作業用ブランチを作成]]節）に戻り，
  一連の作業を複数回（5回以上!）繰り返すこと
  - *体に叩き込む！*

**** GitHub Pagesを作成する                                         :演習:
- GitHubをWebブラウザで開く
- プロジェクトの =Settings -> Pages (side menu)= でGitHub Pagesを開く
- Sourceの項目にある =None= を =main= ブランチに変える
  - Save ボタンを押すとプロジェクト用のURLが表示されるので、控えておく
- index.htmlファイルを作成しHTML書く
- add/commit/pushを適切に行い、GitHubにindex.htmlをアップロードする
- 先程控えたURLにブラウザでアクセスし、作成したHTMLによるページが表示されることを確認

* チーム演習編
** 準備と演習
*** 演習のための準備
**** 概要
- この演習では、最終的に全員でHTMLによるWebサイトを作ることを目指す
- GitHub Pagesの機能を用いる
- Webサイトの例
  - 架空の会社のホームページ
  - 架空の商品紹介ページ
  - 架空の…

**** リモートリポジトリの作成
- チームの代表者1名がGitHubでリポジトリを作成する
  - 名前は「team_project」とする
- 次の手順で作成する
  - [[https://help.github.com/articles/creating-a-new-repository/][Creating a new repository - User Documentation]]
- READMEとライセンスを追加すること
  - 「Initialize this repository with a README」にチェックを入れる
  - 「Add a license:」から「MIT License」を選ぶ

