docs/index.html
<div id="outline-container-orgf4e550d" class="outline-4">
<h4 id="orgf4e550d"><span class="section-number-4">2.2.1.</span> GitHubとは</h4>
<div class="outline-text-4" id="text-2-2-1">
</div>
<ol class="org-ol">
<li><a id="org4338834"></a>GitHubでソーシャルコーディング<br />
<div class="outline-text-5" id="text-2-2-1-1">
<ul class="org-ul">
<li>ソーシャルコーディングのためのクラウド環境
<ul class="org-ul">
<li><a href="https://github.com/">GitHub</a></li>
<li><a href="http://github.co.jp/">GitHub Japan</a></li>
</ul></li>
<li>GitHubが提供する主な機能
<ul class="org-ul">
<li>GitHub flowによる協同開発</li>
<li>Pull requests</li>
<li>Issue / Wiki</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="orgfbabd2a"></a>GitHubアカウントの作成<br />
<div class="outline-text-5" id="text-2-2-1-2">
<ul class="org-ul">
<li>（まだなら）次のURLの指示に従いGitHubアカウントを作成
<ul class="org-ul">
<li><a href="https://help.github.com/articles/signing-up-for-a-new-github-account/">Signing up for a new GitHub account - User Documentation</a></li>
</ul></li>
<li>アカウントの種類
<ul class="org-ul">
<li>無料版で作成する場合「Join GitHub for Free」を選択する</li>
<li>学生の場合「Student Developer Pack」にアップグレードすることもできる</li>
</ul></li>
<li>その後，確認メールが届くので，必要に応じて残りの手順を実施せよ
<ul class="org-ul">
<li><a href="https://help.github.com/categories/setup/">GitHub Help</a></li>
</ul></li>
</ul>
</div>
</li>

<li><a id="orga2355ad"></a>SSHによるGitHubアクセス<br />
<div class="outline-text-5" id="text-2-2-1-3">
<ul class="org-ul">
<li>GitHubへのアクセスはSSHを用いた公開鍵暗号方式の認証を用いる
<ul class="org-ul">
<li>SSH公開鍵の設定を行えば以降のパスワード認証が不要になる</li>
</ul></li>
<li>（まだなら）SSHを生成してGitHubに登録しなさい
<ul class="org-ul">
<li>鍵を生成するとき「passphrases」が聞かれるが，この演習では何も入力しなくてよい</li>
</ul></li>
<li>参考
<ul class="org-ul">
<li><a href="https://docs.github.com/en/authentication/connecting-to-github-with-ssh/generating-a-new-ssh-key-and-adding-it-to-the-ssh-agent">Generating a new SSH key and adding it to the ssh-agent - GitHub Docs</a></li>
<li><a href="https://help.github.com/articles/generating-an-ssh-key/">Generating an SSH key - User Documentation</a></li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-orga62661b" class="outline-4">
<h4 id="orga62661b"><span class="section-number-4">2.2.2.</span> リモートリポジトリ</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
<ol class="org-ol">
<li><a id="orgefee7cf"></a>リモート VS ローカルリポジトリ<br />
<div class="outline-text-5" id="text-2-2-2-1">
<ul class="org-ul">
<li>ローカルリポジトリ
<ul class="org-ul">
<li>git initコマンドを用いて作成したリポジトリを「ローカルリポジトリ」という</li>
</ul></li>
<li>リモートリポジトリ
<ul class="org-ul">
<li>「リモートリポジトリ」とは，サーバ上にあるリポジトリであり，
ローカルのリポジトリと連携させることができる</li>
</ul></li>
<li>リモートリポジトリの利点
<ul class="org-ul">
<li>ネットワークを経由してどこからでも利用することができる</li>
<li>複数人のチームで協同作業をするときに活用できる</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org75d9d71"></a>リモートリポジトリの作成<br />
<div class="outline-text-5" id="text-2-2-2-2">
<ul class="org-ul">
<li>リモートリポジトリをGitHubで作成する
<ul class="org-ul">
<li>名前は「our_project」とする</li>
</ul></li>
<li>次の手順で作成する
<ul class="org-ul">
<li><a href="https://help.github.com/articles/creating-a-new-repository/">Creating a new repository - User Documentation</a></li>
</ul></li>
<li>READMEとライセンスを追加すること
<ul class="org-ul">
<li>「Initialize this repository with a README」にチェックを入れる</li>
<li>「Add a license:」から「MIT License」を選ぶ</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org807f51f"></a>mainブランチについて<br />
<div class="outline-text-5" id="text-2-2-2-3">
<ul class="org-ul">
<li>git initでは最初にできるブランチは <b>master</b> である</li>
<li>GitHubでリポジトリを作成した場合は <b>main</b> に変更された
<ul class="org-ul">
<li><a href="https://github.blog/changelog/2020-10-01-the-default-branch-for-newly-created-repositories-is-now-main/">The default branch for newly-created repositories is now main | GitHub Changelog</a></li>
</ul></li>
<li>以降、masterブランチとの記述は、必要に応じてmainブランチだと読み替えること</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org02f0cf6" class="outline-4">
<h4 id="org02f0cf6"><span class="section-number-4">2.2.3.</span> GitHub flow</h4>
<div class="outline-text-4" id="text-2-2-3">
</div>
<ol class="org-ol">
<li><a id="orgb806162"></a>GitHub flowwによる開発の流れ<br />
<div class="outline-text-5" id="text-2-2-3-1">
<ul class="org-ul">
<li>GitHub flow
<ul class="org-ul">
<li><a href="https://guides.github.com/introduction/flow/">Understanding the GitHub Flow · GitHub Guides</a></li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org4d8ee09"></a>1: リモートリポジトリをローカルに複製<br />
<div class="outline-text-5" id="text-2-2-3-2">
<ul class="org-ul">
<li>リモートにあるリポジトリをローカルに複製することをcloneという
<ul class="org-ul">
<li><a href="https://help.github.com/articles/cloning-a-repository/">Cloning a repository - User Documentation</a></li>
</ul></li>
<li>下記の「$GITHUB_URL」の部分をGitHubのour_projectリポジトリURLにして実行
<ul class="org-ul">
<li>URLは「git@&#x2026;」で始まるSSH接続用のものを用いる
<ul class="org-ul">
<li>リポジトリのURLはブラウザ用のURLとは異なるので注意！</li>
</ul></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8f0075;">cd</span> ~
git clone $<span style="color: #00538b;">GITHUB_URL</span>
<span style="color: #8f0075;">cd</span> our_project
</pre>
</div>

<ul class="org-ul">
<li>この作業は基本的にはプロジェクトに対して一度だけ行うこと</li>
</ul>
</div>
</li>

<li><a id="org72905a8"></a>2: mainから作業用ブランチを作成<br />
<div class="outline-text-5" id="text-2-2-3-3">
<ul class="org-ul">
<li>作業用のブランチを作成して移動する
<ul class="org-ul">
<li>ブランチの名前は「greeting」とする</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git checkout -b greeting
</pre>
</div>
</div>
</li>

<li><a id="org65ac0e0"></a>3: ブランチで編集作業を行う<br />
<div class="outline-text-5" id="text-2-2-3-4">
<ul class="org-ul">
<li>ここでは，hello.txtという名前のファイルを作成する</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8f0075;">echo</span> <span style="color: #2544bb;">'Hello GitHub'</span> &gt; hello.txt
</pre>
</div>
</div>
</li>

<li><a id="orgb58f9e5"></a>4: ブランチでコミットを作成<br />
<div class="outline-text-5" id="text-2-2-3-5">
<ul class="org-ul">
<li>変更した内容をステージングしてからコミットする</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git add .
git commit -m <span style="color: #2544bb;">'Create hello.txt'</span>
</pre>
</div>

<ul class="org-ul">
<li>この編集，add，commitの作業は作業が一区切りつくまで何回も繰り返してよい…
<ul class="org-ul">
<li>が，こまめにpushするのが良いとされる</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="orgd89de12"></a>5: ブランチをリモートに送る<br />
<div class="outline-text-5" id="text-2-2-3-6">
<ul class="org-ul">
<li>ブランチで作成したコミットをリモートに送る
<ul class="org-ul">
<li>下記のoriginはリポジトリのURLの別名として自動で設定されているもの</li>
<li>greetingは作業しているブランチ名</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git push -u origin greeting
</pre>
</div>
</div>
</li>

<li><a id="orgd4bc2cf"></a>6. GitHubでプルリクエストを送る<br />
<div class="outline-text-5" id="text-2-2-3-7">
<ul class="org-ul">
<li>ブランチがGitHubに登録されたことを確認し，Pull requestを作成する</li>
<li>手順は次のとおり
<ul class="org-ul">
<li><a href="https://help.github.com/articles/using-pull-requests/">Using pull requests - User Documentation</a> の前半</li>
<li><a href="https://help.github.com/articles/creating-a-pull-request/">Creating a pull request - User Documentation</a></li>
</ul></li>
</ul>
</div>
</li>

<li><a id="orge527629"></a>7. GitHubでレビュー（＋自動テスト）<br />
<div class="outline-text-5" id="text-2-2-3-8">
<ul class="org-ul">
<li>プルリクエストを用いたレビューの方法は下記参照
<ul class="org-ul">
<li><a href="https://help.github.com/articles/using-pull-requests/">Using pull requests - User Documentation</a> の後半</li>
</ul></li>
<li>人手によるレビューの他，自動的なテストも行うのが望ましい（説明は省略）</li>
</ul>
</div>
</li>

<li><a id="org521de08"></a>8. GitHubでプルリクエストをマージ<br />
<div class="outline-text-5" id="text-2-2-3-9">
<ul class="org-ul">
<li>Pull requestのレビューが済んだらマージする
<ul class="org-ul">
<li><a href="https://help.github.com/articles/merging-a-pull-request/">Merging a pull request - User Documentation</a></li>
</ul></li>
<li>マージが完了したら，ローカル・リモート共に，マージ済みのブランチは削除してよい</li>
</ul>
</div>
</li>

<li><a id="org0227ea2"></a>9. ローカルのmainを最新版にする<br />
<div class="outline-text-5" id="text-2-2-3-10">
<ul class="org-ul">
<li>GitHubで行ったマージをローカルに反映させる
<ul class="org-ul">
<li>masterブランチに移動してgit pull</li>
<li>不要になった作業用ブランチは削除</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git checkout master
git pull
git branch -d greeting
</pre>
</div>
</div>
</li>

<li><a id="orgbb9406d"></a>GitHub Flowに習熟する！&#xa0;&#xa0;&#xa0;<span class="tag"><span class="__">演習</span></span><br />
<div class="outline-text-5" id="text-2-2-3-11">
<ul class="org-ul">
<li>ここで手順2:（<a href="#org72905a8">2.2.3.3</a>節）に戻り，
一連の作業を複数回（5回以上!）繰り返すこと
<ul class="org-ul">
<li><b>体に叩き込む！</b></li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org0b8e68c"></a>GitHub Pagesを作成する&#xa0;&#xa0;&#xa0;<span class="tag"><span class="__">演習</span></span><br />
<div class="outline-text-5" id="text-2-2-3-12">
<ul class="org-ul">
<li>GitHubをWebブラウザで開く</li>
<li>プロジェクトの <code>Settings -&gt; Pages (side menu)</code> でGitHub Pagesを開く</li>
<li>Sourceの項目にある <code>None</code> を <code>main</code> ブランチに変える
<ul class="org-ul">
<li>Save ボタンを押すとプロジェクト用のURLが表示されるので、控えておく</li>
</ul></li>
<li>index.htmlファイルを作成しHTML書く</li>
<li>add/commit/pushを適切に行い、GitHubにindex.htmlをアップロードする</li>
<li>先程控えたURLにブラウザでアクセスし、作成したHTMLによるページが表示されることを確認</li>
</ul>
</div>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org4c6e0e2" class="outline-2">
<h2 id="org4c6e0e2"><span class="section-number-2">3.</span> チーム演習編</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org522b1d8" class="outline-3">
<h3 id="org522b1d8"><span class="section-number-3">3.1.</span> 準備と演習</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org958c68f" class="outline-4">
<h4 id="org958c68f"><span class="section-number-4">3.1.1.</span> 演習のための準備</h4>
<div class="outline-text-4" id="text-3-1-1">
</div>
<ol class="org-ol">
<li><a id="org6e4266f"></a>概要<br />
<div class="outline-text-5" id="text-3-1-1-1">
<ul class="org-ul">
<li>この演習では、最終的に全員でHTMLによるWebサイトを作ることを目指す</li>
<li>GitHub Pagesの機能を用いる</li>
<li>Webサイトの例
<ul class="org-ul">
<li>架空の会社のホームページ</li>
<li>架空の商品紹介ページ</li>
<li>架空の…</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org994df70"></a>リモートリポジトリの作成<br />
<div class="outline-text-5" id="text-3-1-1-2">
<ul class="org-ul">
<li>チームの代表者1名がGitHubでリポジトリを作成する
<ul class="org-ul">
<li>名前は「team_project」とする</li>
</ul></li>
<li>次の手順で作成する
<ul class="org-ul">
<li><a href="https://help.github.com/articles/creating-a-new-repository/">Creating a new repository - User Documentation</a></li>
</ul></li>
<li>READMEとライセンスを追加すること
<ul class="org-ul">
<li>「Initialize this repository with a README」にチェックを入れる</li>
<li>「Add a license:」から「MIT License」を選ぶ</li>
</ul></li>
</ul>
</div>
</li>
