src/github_practice.org
**** コラボレーターの追加
- 代表者は残りのメンバーを協同作業者（コラボレータ）として追加する
  - [[https://help.github.com/articles/inviting-collaborators-to-a-personal-repository/][Inviting collaborators to a personal repository - User Documentation]]
- 招待されたメンバーには確認のメールが届く
  - これにより，全員がGitHubのリポジトリにpushできるようになる

**** リポジトリのclone
- 全員，リポジトリをローカルにcloneする
  - [[https://help.github.com/articles/cloning-a-repository/][Cloning a repository - User Documentation]]

#+BEGIN_SRC bash
cd ~
git clone $GITHUB_URL
cd team_project
#+END_SRC

*** チーム演習
**** 課題1: GitHubのIssue/Wikiを学ぶ
- リポジトリのIssue機能を使ってみよう
  - 一人1つIssueを登録する
  - メンバーのIssueに挨拶する（投稿する）
  - 終わったらIssueを閉じてみる
- リポジトリのWikiを使ってみよう
  - Wikiを使ってチームメンバーの自己紹介をしてみよう
- なお，この演習にあまり時間をかけてはならない

**** 課題2: まずは全員1回pushしよう
- 全員1回，最初のGitHub Flowを成功させよう
- GitHubのアカウント名（$GITHUB_NAME）でブランチを切り，コミットするファイルを作る
- ファイル名は各自の＋「.html」とする

#+BEGIN_SRC bash
git checkout -b $GITHUB_NAME
# エディタで$GITHUB_NAME.htmlを作成
git add $GITHUB_NAME.html
git commit -m '＜メッセージ＞'
git push -u origin $GITHUB_NAME
#+END_SRC

**** 課題3: プルリクエストの作成
- pushしたブランチからプルリクエストを出してみよう
- 他のメンバーのプルリクエストにコメントしてみよう

**** 課題4: マージの練習
- プルリクエストを出した人が自分でマージしてみよう
- この段階でコンフリクトが出ることはないはず
  （同じファイルを編集していない）だが，もし
  マージできない場合は，プルリクエストを削除し，
  課題2からやり直す

**** 課題5: 全員のmasterを最新にする
- 全員のローカルのmasterブランチを最新にする
- 各自次のコマンドを実行

#+BEGIN_SRC bash
git pull
#+END_SRC

- ローカルに他のメンバーが作成したファイルができているか確認

**** 課題6: 再びブランチをpushする
- まず，masterが最新版であることを確認
- 作業を決めて， *作業の内容がわかりやすい名前* でブランチを作る
- =$GITHUB_NAME.html= に，中身を追加してみよう（内容は何でも良い）
- =git add/commit/push= を正確に実行しよう
- ブランチが無事pushできたら，GitHubをブラウザで確認する

**** 課題7: 再びプルリクエストとマージ
- 再びプルリクエストとマージを行ってみよう
- プルリクエストのコメントには顔文字なども
  利用できるので活用してみよう
  - やり方は各自で調べること
- 今度は他のメンバーにマージを依頼しても良い

**** 課題8: 何回も繰り返す
- 同じファイルに更なる変更を加え，GitHub Flowを回してみよう
- これを最低3回は繰り返したい

**** 課題9: ぼちぼちコンフリクト
- 誰かが空の「index.html」ファイルを作成する
- 全員でindex.htmlを編集してみよう
  - $MY_FILEへのリンクを貼る
- pushしてプルリクエストを出してみる
- 何人かはコンフリクトになるはずだ

**** 課題10: コンフリクトの解消
- コンフリクトが出たメンバーは，それを解消してみよう
- コンフリクトが出なかったメンバーは，コンフリクトが出ているメンバーの
  作業を見る
  - 困っていたら助けてあげよう

**** 課題11: Webサイトを作ってみよう
- チームで内容を相談し，Webサイトを作ってみよう
- index.htmlや$MY_FILE以外にもファイルを追加して
  素敵なWebサイトを作ろう
- 可能ならばCSSやJavaScriptを使っても良いが必須ではない

*** GitHubでのコンフリクトと解消方法
**** GitHub flow におけるコンフリクトについて
- コンフリクトとは？
  - コンフリクトは、コードの同じ箇所を複数の人が別々に編集すると発生
- コンフリクトが起きると？
  - GitHub に提出した Pull requests が自動的にマージできない

**** コンフリクトへの基本的な対処法
- 初心者は、演習の最初の方では「他人と同じファイルを編集しない」こと
  にして、操作になれる
  - 上達したら積極的にコンフリクトを起こしてみて、その解決方法を学ぶ
- コミットはできるだけ細かく作成すると良い
  - その分，他の人とかち合う可能性が減る

**** GitHubでのコンフリクトの解消
- nobitaとshizukaのシナリオでnobitaの作業がGitHubでマージされたとする
  - shizukaが作成したPull requestはマージできなくなる
- ローカルのmainブランチを最新版にする
  - pullを行う
- shizukaブランチでmainの内容をmergeする
  - その後、手動でコンフリクトを解消
- 再度shizukaをpushして、プルリクエストがマージ可能になれば成功

**** GitHubでのコンフリクトの解消方法（一例）
#+begin_src bash
# ローカルのmainを最新に
git checkout main
git pull
# shizukaに移動してマージ
git checkout shizuka
git merge main
# ここでコンフリクトを解消する
git add .
git commit -m 'Merge'
git push -u origin shizuka
#+end_src

* 参考資料
** より進んだGitの操作
*** ファイルの削除と名前の変更
**** Gitに無視させたいファイル
- ツールが生成する中間ファイルなど，Gitで管理させたくないファイルは
  予め「.gitignore」ファイルに記述しておく
- なお，「.gitignore」ファイル自体はGitがトラッキングするファイルに含める
- .gitignoreの書き方については各自で調べよ

**** Gitが追跡するファイルの削除と名前の変更
- Gitが追跡しているファイルであっても，
  シェルのrmコマンドやmvコマンドで削除や名前の変更をしてよい
- 「git add .」コマンドを実行すると，Gitは削除や名前の変更も
  自動的に検知する
  - 「git rm」や「git mv」は使わなくてよい
*** 操作を取り消すコマンド
**** Gitで行った操作の取り消し
- まちがって
  - ファイルをステージングさせた！
  - ステージングをコミットした！
- などの場合，操作を取り消すことができる
  - 特定のファイルの変更の取り消し
  - 特定のコミットの取り消し

**** HEADによるコミットの指定
- 特定のコミットのIDを指定する方法に「HEAD」を使った相対指定がある
  - showコマンドで確認しながら用いると良い（下記はサンプル）

#+BEGIN_SRC bash
git show HEAD~1
git show HEAD~1^2
#+END_SRC

**** ステージング/コミットの修正
ファイルのステージングを取り消す

#+BEGIN_SRC bash
git reset $FILE
#+END_SRC

$COMMIT_IDより後のコミットの取り消し（ローカルは保存）

#+BEGIN_SRC bash
git reset $COMMIT_ID
#+END_SRC

$COMMIT_IDより後のコミットの取り消し（ローカルの変更も破棄）

#+BEGIN_SRC bash
git reset --hard $COMMIT_ID
#+END_SRC

**** 誤って編集や削除や修正したファイルの回復
- file.txtを誤って編集や削除した場合
- addする前
  - ステージング領域からの取り出し

#+BEGIN_SRC bash
git checkout file.txt
#+END_SRC

- addした後
  - 直近のコミットからの取り出し

#+BEGIN_SRC bash
git checkout HEAD file.txt
#+END_SRC

**** push済みのコミットの取り消し
- 最後に行ったコミットが理由でコンフリクトが発生したような場合，
  次の操作により，「取り消しコミット」を作成することができる

#+BEGIN_SRC bash
git revert HEAD
#+END_SRC

- 最後の作業が取り消されていることを確認
- その後は，この取り消しコミットをpushすると，
  リモートでの変更内容も取り消される

*** 作業の一度中断と再開
**** やりかけの作業のstash
- あるブランチで作業中に他のブランチに
  一時的に移動したいことがある
  - 作業の途中でmasterブランチを最新にする，など
- このような場合，git stashコマンドが活用できる
  ので調べてみよ
