docs/index.html

<li><a id="org38e89a3"></a>コラボレーターの追加<br />
<div class="outline-text-5" id="text-3-1-1-3">
<ul class="org-ul">
<li>代表者は残りのメンバーを協同作業者（コラボレータ）として追加する
<ul class="org-ul">
<li><a href="https://help.github.com/articles/inviting-collaborators-to-a-personal-repository/">Inviting collaborators to a personal repository - User Documentation</a></li>
</ul></li>
<li>招待されたメンバーには確認のメールが届く
<ul class="org-ul">
<li>これにより，全員がGitHubのリポジトリにpushできるようになる</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="orgb67693c"></a>リポジトリのclone<br />
<div class="outline-text-5" id="text-3-1-1-4">
<ul class="org-ul">
<li>全員，リポジトリをローカルにcloneする
<ul class="org-ul">
<li><a href="https://help.github.com/articles/cloning-a-repository/">Cloning a repository - User Documentation</a></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8f0075;">cd</span> ~
git clone $<span style="color: #00538b;">GITHUB_URL</span>
<span style="color: #8f0075;">cd</span> team_project
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org39cef70" class="outline-4">
<h4 id="org39cef70"><span class="section-number-4">3.1.2.</span> チーム演習</h4>
<div class="outline-text-4" id="text-3-1-2">
</div>
<ol class="org-ol">
<li><a id="org6670199"></a>課題1: GitHubのIssue/Wikiを学ぶ<br />
<div class="outline-text-5" id="text-3-1-2-1">
<ul class="org-ul">
<li>リポジトリのIssue機能を使ってみよう
<ul class="org-ul">
<li>一人1つIssueを登録する</li>
<li>メンバーのIssueに挨拶する（投稿する）</li>
<li>終わったらIssueを閉じてみる</li>
</ul></li>
<li>リポジトリのWikiを使ってみよう
<ul class="org-ul">
<li>Wikiを使ってチームメンバーの自己紹介をしてみよう</li>
</ul></li>
<li>なお，この演習にあまり時間をかけてはならない</li>
</ul>
</div>
</li>

<li><a id="org2c4201f"></a>課題2: まずは全員1回pushしよう<br />
<div class="outline-text-5" id="text-3-1-2-2">
<ul class="org-ul">
<li>全員1回，最初のGitHub Flowを成功させよう</li>
<li>GitHubのアカウント名（$GITHUB_NAME）でブランチを切り，コミットするファイルを作る</li>
<li>ファイル名は各自の＋「.html」とする</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git checkout -b $<span style="color: #00538b;">GITHUB_NAME</span>
<span style="color: #505050; font-style: italic;"># </span><span style="color: #505050; font-style: italic;">&#12456;&#12487;&#12451;&#12479;&#12391;$GITHUB_NAME.html&#12434;&#20316;&#25104;</span>
git add $<span style="color: #00538b;">GITHUB_NAME</span>.html
git commit -m <span style="color: #2544bb;">'&#65308;&#12513;&#12483;&#12475;&#12540;&#12472;&#65310;'</span>
git push -u origin $<span style="color: #00538b;">GITHUB_NAME</span>
</pre>
</div>
</div>
</li>

<li><a id="orgc02f347"></a>課題3: プルリクエストの作成<br />
<div class="outline-text-5" id="text-3-1-2-3">
<ul class="org-ul">
<li>pushしたブランチからプルリクエストを出してみよう</li>
<li>他のメンバーのプルリクエストにコメントしてみよう</li>
</ul>
</div>
</li>

<li><a id="org1d45cff"></a>課題4: マージの練習<br />
<div class="outline-text-5" id="text-3-1-2-4">
<ul class="org-ul">
<li>プルリクエストを出した人が自分でマージしてみよう</li>
<li>この段階でコンフリクトが出ることはないはず
（同じファイルを編集していない）だが，もし
マージできない場合は，プルリクエストを削除し，
課題2からやり直す</li>
</ul>
</div>
</li>

<li><a id="org0babfb1"></a>課題5: 全員のmasterを最新にする<br />
<div class="outline-text-5" id="text-3-1-2-5">
<ul class="org-ul">
<li>全員のローカルのmasterブランチを最新にする</li>
<li>各自次のコマンドを実行</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git pull
</pre>
</div>

<ul class="org-ul">
<li>ローカルに他のメンバーが作成したファイルができているか確認</li>
</ul>
</div>
</li>

<li><a id="orgb0bc5e1"></a>課題6: 再びブランチをpushする<br />
<div class="outline-text-5" id="text-3-1-2-6">
<ul class="org-ul">
<li>まず，masterが最新版であることを確認</li>
<li>作業を決めて， <b>作業の内容がわかりやすい名前</b> でブランチを作る</li>
<li><code>$GITHUB_NAME.html</code> に，中身を追加してみよう（内容は何でも良い）</li>
<li><code>git add/commit/push</code> を正確に実行しよう</li>
<li>ブランチが無事pushできたら，GitHubをブラウザで確認する</li>
</ul>
</div>
</li>

<li><a id="org3805c9c"></a>課題7: 再びプルリクエストとマージ<br />
<div class="outline-text-5" id="text-3-1-2-7">
<ul class="org-ul">
<li>再びプルリクエストとマージを行ってみよう</li>
<li>プルリクエストのコメントには顔文字なども
利用できるので活用してみよう
<ul class="org-ul">
<li>やり方は各自で調べること</li>
</ul></li>
<li>今度は他のメンバーにマージを依頼しても良い</li>
</ul>
</div>
</li>

<li><a id="org045abc1"></a>課題8: 何回も繰り返す<br />
<div class="outline-text-5" id="text-3-1-2-8">
<ul class="org-ul">
<li>同じファイルに更なる変更を加え，GitHub Flowを回してみよう</li>
<li>これを最低3回は繰り返したい</li>
</ul>
</div>
</li>

<li><a id="org1dc7019"></a>課題9: ぼちぼちコンフリクト<br />
<div class="outline-text-5" id="text-3-1-2-9">
<ul class="org-ul">
<li>誰かが空の「index.html」ファイルを作成する</li>
<li>全員でindex.htmlを編集してみよう
<ul class="org-ul">
<li>$MY_FILEへのリンクを貼る</li>
</ul></li>
<li>pushしてプルリクエストを出してみる</li>
<li>何人かはコンフリクトになるはずだ</li>
</ul>
</div>
</li>

<li><a id="orged3e7cb"></a>課題10: コンフリクトの解消<br />
<div class="outline-text-5" id="text-3-1-2-10">
<ul class="org-ul">
<li>コンフリクトが出たメンバーは，それを解消してみよう</li>
<li>コンフリクトが出なかったメンバーは，コンフリクトが出ているメンバーの
作業を見る
<ul class="org-ul">
<li>困っていたら助けてあげよう</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org2897478"></a>課題11: Webサイトを作ってみよう<br />
<div class="outline-text-5" id="text-3-1-2-11">
<ul class="org-ul">
<li>チームで内容を相談し，Webサイトを作ってみよう</li>
<li>index.htmlや$MY_FILE以外にもファイルを追加して
素敵なWebサイトを作ろう</li>
<li>可能ならばCSSやJavaScriptを使っても良いが必須ではない</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org5c660d9" class="outline-4">
<h4 id="org5c660d9"><span class="section-number-4">3.1.3.</span> GitHubでのコンフリクトと解消方法</h4>
<div class="outline-text-4" id="text-3-1-3">
</div>
<ol class="org-ol">
<li><a id="org25f3a7c"></a>GitHubにおけるコンフリクトについて<br />
<ol class="org-ol">
<li><a id="org3147b8d"></a>複数人開発で生じやすいコンフリクト<br />
<div class="outline-text-6" id="text-3-1-3-1-1">
<ul class="org-ul">
<li>コンフリクトは、コードの同じ箇所を複数の人が別々に編集すると発生</li>
<li>コンフリクトが起きると？
<ul class="org-ul">
<li>GitHub に提出した Pull requests が <b>自動的にマージできない</b></li>
</ul></li>
</ul>
</div>
</li>
<li><a id="orgb9103fe"></a>コンフリクトへの基本的な対処法<br />
<div class="outline-text-6" id="text-3-1-3-1-2">
<ul class="org-ul">
<li>初心者は、演習の最初の方では「他人と同じファイルを編集しない」こと にして、操作になれる
<ul class="org-ul">
<li>上達したら積極的にコンフリクトを起こしてみて、その解決方法を学ぶ</li>
</ul></li>
<li>最初のうち、コミットはできるだけ細かく作成すると良い
<ul class="org-ul">
<li>その分、他の人とかち合う可能性が減る</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="orga6d59b0"></a>GitHubでのコンフリクトの解消<br />
<div class="outline-text-6" id="text-3-1-3-1-3">
<ul class="org-ul">
<li>nobitaとshizukaのシナリオで、nobitaの作業がGitHubでマージされたとする
<ul class="org-ul">
<li>今、shizukaが作成したPull requestはマージできない</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="orge5060f3"></a>GitHubでのコンフリクトの解消方法（一例）<br />
<div class="outline-text-6" id="text-3-1-3-1-4">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #505050; font-style: italic;"># </span><span style="color: #505050; font-style: italic;">&#12525;&#12540;&#12459;&#12523;&#12398;main&#12434;&#26368;&#26032;&#12395;</span>
git checkout main
git pull
<span style="color: #505050; font-style: italic;"># </span><span style="color: #505050; font-style: italic;">shizuka&#12395;&#31227;&#21205;&#12375;&#12390;&#12510;&#12540;&#12472;</span>
git checkout shizuka
git merge main
<span style="color: #505050; font-style: italic;"># </span><span style="color: #505050; font-style: italic;">&#12371;&#12371;&#12391;&#12467;&#12531;&#12501;&#12522;&#12463;&#12488;&#12434;&#35299;&#28040;&#12377;&#12427;</span>
git add .
git commit -m <span style="color: #2544bb;">'Merge'</span>
git push -u origin shizuka
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgabda240" class="outline-2">
<h2 id="orgabda240"><span class="section-number-2">4.</span> 参考資料</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc4606de" class="outline-3">
<h3 id="orgc4606de"><span class="section-number-3">4.1.</span> より進んだGitの操作</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org4bba12c" class="outline-4">
<h4 id="org4bba12c"><span class="section-number-4">4.1.1.</span> ファイルの削除と名前の変更</h4>
<div class="outline-text-4" id="text-4-1-1">
</div>
<ol class="org-ol">
<li><a id="org75fe5db"></a>Gitに無視させたいファイル<br />
<div class="outline-text-5" id="text-4-1-1-1">
<ul class="org-ul">
<li>ツールが生成する中間ファイルなど，Gitで管理させたくないファイルは
予め「.gitignore」ファイルに記述しておく</li>
<li>なお，「.gitignore」ファイル自体はGitがトラッキングするファイルに含める</li>
<li>.gitignoreの書き方については各自で調べよ</li>
</ul>
</div>
</li>

<li><a id="orga211f53"></a>Gitが追跡するファイルの削除と名前の変更<br />
<div class="outline-text-5" id="text-4-1-1-2">
<ul class="org-ul">
<li>Gitが追跡しているファイルであっても，
シェルのrmコマンドやmvコマンドで削除や名前の変更をしてよい</li>
<li>「git add .」コマンドを実行すると，Gitは削除や名前の変更も
自動的に検知する
<ul class="org-ul">
<li>「git rm」や「git mv」は使わなくてよい</li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org4b89564" class="outline-4">
<h4 id="org4b89564"><span class="section-number-4">4.1.2.</span> 操作を取り消すコマンド</h4>
<div class="outline-text-4" id="text-4-1-2">
</div>
<ol class="org-ol">
<li><a id="org53a0c4e"></a>Gitで行った操作の取り消し<br />
<div class="outline-text-5" id="text-4-1-2-1">
<ul class="org-ul">
<li>まちがって
<ul class="org-ul">
<li>ファイルをステージングさせた！</li>
<li>ステージングをコミットした！</li>
</ul></li>
<li>などの場合，操作を取り消すことができる
<ul class="org-ul">
<li>特定のファイルの変更の取り消し</li>
<li>特定のコミットの取り消し</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org48ce2e0"></a>HEADによるコミットの指定<br />
<div class="outline-text-5" id="text-4-1-2-2">
<ul class="org-ul">
<li>特定のコミットのIDを指定する方法に「HEAD」を使った相対指定がある
<ul class="org-ul">
<li>showコマンドで確認しながら用いると良い（下記はサンプル）</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git show HEAD~1
git show HEAD~1^2
</pre>
</div>
</div>
</li>

<li><a id="org3610d81"></a>ステージング/コミットの修正<br />
<div class="outline-text-5" id="text-4-1-2-3">
<p>
ファイルのステージングを取り消す
</p>

<div class="org-src-container">
<pre class="src src-bash">git reset $<span style="color: #00538b;">FILE</span>
</pre>
</div>

<p>
$COMMIT_IDより後のコミットの取り消し（ローカルは保存）
</p>

<div class="org-src-container">
<pre class="src src-bash">git reset $<span style="color: #00538b;">COMMIT_ID</span>
</pre>
</div>

<p>
$COMMIT_IDより後のコミットの取り消し（ローカルの変更も破棄）
</p>

<div class="org-src-container">
<pre class="src src-bash">git reset --hard $<span style="color: #00538b;">COMMIT_ID</span>
</pre>
</div>
</div>
</li>

<li><a id="orge887fcc"></a>誤って編集や削除や修正したファイルの回復<br />
<div class="outline-text-5" id="text-4-1-2-4">
<ul class="org-ul">
<li>file.txtを誤って編集や削除した場合</li>
<li>addする前
<ul class="org-ul">
<li>ステージング領域からの取り出し</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git checkout file.txt
</pre>
</div>

<ul class="org-ul">
<li>addした後
<ul class="org-ul">
<li>直近のコミットからの取り出し</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git checkout HEAD file.txt
</pre>
</div>
</div>
</li>

<li><a id="org0ae7297"></a>push済みのコミットの取り消し<br />
<div class="outline-text-5" id="text-4-1-2-5">
<ul class="org-ul">
<li>最後に行ったコミットが理由でコンフリクトが発生したような場合，
次の操作により，「取り消しコミット」を作成することができる</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">git revert HEAD
</pre>
</div>

<ul class="org-ul">
<li>最後の作業が取り消されていることを確認</li>
<li>その後は，この取り消しコミットをpushすると，
リモートでの変更内容も取り消される</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org3b2a411" class="outline-4">
<h4 id="org3b2a411"><span class="section-number-4">4.1.3.</span> 作業の一度中断と再開</h4>
<div class="outline-text-4" id="text-4-1-3">
</div>
<ol class="org-ol">
<li><a id="orga9c90ba"></a>やりかけの作業のstash<br />
<div class="outline-text-5" id="text-4-1-3-1">
<ul class="org-ul">
<li>あるブランチで作業中に他のブランチに
一時的に移動したいことがある
<ul class="org-ul">
<li>作業の途中でmasterブランチを最新にする，など</li>
</ul></li>
<li>このような場合，git stashコマンドが活用できる
ので調べてみよ</li>
</ul>
</div>
</li>
</ol>
</div>
